Terraform plan:
```
Terraform will perform the following actions:

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-4s must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "http-requests-latency-fhir-eob-4s" {
        actions_enabled                       = true
        alarm_actions                         = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
        alarm_description                     = "HTTP EOB Request Latency p90 exceeds 4000.0 seconds in APP-ENV: bfd-test over 900 seconds"
      ~ alarm_name                            = "bfd-test-http-requests-latency-fhir-eob" -> "bfd-test-http-requests-latency-fhir-eob-4s" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-http-requests-latency-fhir-eob" -> (known after apply)
        comparison_operator                   = "GreaterThanThreshold"
        datapoints_to_alarm                   = 1
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
        evaluation_periods                    = 1
        extended_statistic                    = "p90"
      ~ id                                    = "bfd-test-http-requests-latency-fhir-eob" -> (known after apply)
      - insufficient_data_actions             = [] -> null
        metric_name                           = "http-requests/latency/fhir/eob"
        namespace                             = "bfd-test/bfd-server"
        ok_actions                            = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
        period                                = 900
      - tags                                  = {} -> null
        threshold                             = 4000
        treat_missing_data                    = "notBreaching"
    }

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-6s must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "http-requests-latency-fhir-eob-6s" {
        actions_enabled                       = true
        alarm_actions                         = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      ~ alarm_description                     = "HTTP EOB Request Latency p90 exceeds 4000.0 seconds in APP-ENV: bfd-test over 900 seconds" -> "HTTP EOB Request Latency p99 exceeds 6000.0 seconds in APP-ENV: bfd-test over 3600 seconds"
      ~ alarm_name                            = "bfd-test-http-requests-latency-fhir-eob" -> "bfd-test-http-requests-latency-fhir-eob-6s" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-http-requests-latency-fhir-eob" -> (known after apply)
        comparison_operator                   = "GreaterThanThreshold"
        datapoints_to_alarm                   = 1
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
        evaluation_periods                    = 1
      ~ extended_statistic                    = "p90" -> "p99"
      ~ id                                    = "bfd-test-http-requests-latency-fhir-eob" -> (known after apply)
      - insufficient_data_actions             = [] -> null
        metric_name                           = "http-requests/latency/fhir/eob"
        namespace                             = "bfd-test/bfd-server"
        ok_actions                            = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      ~ period                                = 900 -> 3600
      - tags                                  = {} -> null
      ~ threshold                             = 4000 -> 6000
        treat_missing_data                    = "notBreaching"
    }
```

This may fail because two operations will try to destroy the same thing, so probably best to destroy it manually first.